export const ReactInterview = {
  id: 2521,
  title: "React",
  children: [
    {
      title: "Основные концепции",
      type: "text",
      description: `
                <ul>
                  <li>Что такое JSX?</li>
                  <li>Что такое JSX-компоненты?</li>
                  <li>Что такое виртуальный DOM?</li>
                  <li>Что такое реквизиты в React?</li>
                  <li>Что такое фрагмент React?</li>
                  <li>Что такое children в React?</li>
                </ul>
              `,
    },
    {
      title: "Компоненты",
      type: "text",
      description: `
                <ul>
                  <li>Что такое Portal?</li>
                  <li>В чем разница между классовыми и функциональными компонентами?</li>
                  <li>Чем управляемые компоненты отличаются от неуправляемых?</li>
                  <li>Как выполнить рендеринг элементов массива?</li>
                  <li>Что такое методы жизненного цикла компонента?</li>
                  <li>Как работают условный рендеринг элементов?</li>
                  <li>Как отследить размонтирование функционального компонента?</li>
                  <li>Что такое пользовательский хук?</li>
                  <li>Перечислите правила создания пользовательского хука.</li>
                </ul>
              `,
    },
    {
      title: "Хуки",
      type: "text",
      description: `
                <ul>
                  <li>Какие хуки вы знаете?</li>
                  <li>В чем заключаются особенности использования useState?</li>
                  <li>В чем заключаются особенности использования useEffect?</li>
                  <li>Для чего и как используется useMemo?</li>
                  <li>Для чего используется useCallback и как он работает?</li>
                  <li>В чем разница между useMemo и useCallback?</li>
                  <li>Для чего используется useRef и как он работает?</li>
                  <li>Для чего используется useContext и как он работает?</li>
                </ul>
              `,
    },
    {
      title: "Состояние",
      type: "text",
      description: `
                <ul>
                  <li>Что такое менеджер состояний и с какими из них вы работали?</li>
                  <li>В каких случаях можно использовать локальное состояние, а когда следует использовать глобальное состояние?</li>
                  <li>Что такое reducer в Redux и какие параметры он принимает?</li>
                  <li>Какой паттерн реализует Redux?</li>
                  <li>Что такое Redux?</li>
                  <li>В чем разница между Redux и MobX?</li>
                  <li>Что такое store?</li>
                  <li>Что такое action?</li>
                  <li>Что такое reducer?</li>
                  <li>Что такое middleware?</li>
                  <li>Что такое dispatch?</li>
                  <li>Что такое subscribe?</li>
                  <li>Что такое bindActionCreators?</li>
                  <li>Что такое действие и как можно изменить состояние в Redux?</li>
                </ul>
              `,
    },
    {
      title: "Архитектура",
      type: "text",
      description: `
                <ul>
                  <li>Как бы вы построили хорошую архитектуру проекта на React?</li>
                  <li>Что такое Feature-Sliced Design?</li>
                  <li>Как выполняется валидация данных в React-приложении?</li>
                  <li>Какие архитектурные решения для React вы знаете?</li>
                  <li>Расскажите об основных библиотеках React, которые вы знаете. Какие у них плюсы и минусы?</li>
                </ul>
              `,
    },
    {
      title: "Другие аспекты",
      type: "text",
      description: `
                <ul>
                  <li>Как отследить изменения поля объекта в функциональном компоненте?</li>
                  <li>Как получить доступ к элементу DOM?</li>
                  <li>Как обрабатывать асинхронные действия в Redux Thunk?</li>
                  <li>Зачем нужны ключи в списках при использовании map()?</li>
                  <li>Что такое React.memo()?</li>
                  <li>Что такое React Reconciliation?</li>
                  <li>Что такое публичный API?</li>
                  <li>Как оптимизировать производительность React-приложения?</li>
                </ul>
              `,
    },
    {
      title: "Частые вопросы",
      type: "text",
      description: `
                <ul>
                  <li>В чем разница между controlled и uncontrolled компонентами?</li>
                  <li>Как работает механизм контекста в React?</li>
                  <li>Что такое HOC (Higher-Order Component)?</li>
                  <li>Как использовать React Router?</li>
                </ul>
              `,
    },
  ],
};
