export const testCookies = {
  id: 100105,
  title: "Cookie",
  questions: [
    {
      id: 100106,
      question: "Что такое cookie и для чего они используются в веб-разработке?",
      answer: `
      Cookie - Хранит данные на стороне клиента, отправляемые на сервер при каждом запросе.
      Размер: Ограничен примерно 4 КБ.
      Время жизни: Может иметь заданное время жизни и храниться до его истечения.
      Доступ: Доступен для сервера и клиента.
      `,
    },
    {
      id: 100107,
      question: "Какие атрибуты могут быть у cookies и как они влияют на поведение cookies?",
      answer: ``,
    },
    {
      id: 100108,
      question: "Какие меры предосторожности необходимо соблюдать при работе с cookies с точки зрения безопасности?",
      answer: ``,
    }
  ],
};