export const testInheritance = {
  id: 101400,
  title: "Наследование",
  questions: [
    {
      id: 101401,
      question: "Что такое прототипное наследование?",
      answer: `Прототипное наследование – это способ, позволяющий объектам в JavaScript 
      наследовать свойства и методы от других объектов, не полагаясь на классы. Это достигается 
      путем создания цепочки прототипов, где каждый объект имеет ссылку на свой прототип 
      (родительский объект), который, в свою очередь, может иметь свой прототип и так далее. `,
    },
    {
      id: 101402,
      question: "",
      answer: ``,
    },
    {
      id: 101403,
      question: "",
      answer: ``,
    },
    {
      id: 101404,
      question: "",
      answer: ``,
    },
    {
      id: 101405,
      question: "",
      answer: ``,
    },
  ],
};
