export const testEvents = {
  id: 100109,
  title: "Events",
  questions: [
    {
      id: 100110,
      question: "Что такое DOM событие и как его можно отловить в JavaScript?",
      answer: ``,
    },
    {
      id: 100111,
      question: "Как можно предотвратить стандартное поведение события в JavaScript? Приведите пример.",
      answer: ``,
    },
    {
      id: 100112,
      question: "Объясните, что такое всплытие и перехват событий. Как вы можете использовать делегирование событий, чтобы оптимизировать обработку событий на веб-странице?",
      answer: ``,
    }
  ],
};