const test1 = {
  id: 1,
  title: "Тест по Agile",
  questions: [
    {
      id: 1,
      text: "Что такое Agile?",
      answer: "Agile — это гибкий подход к управлению проектами и разработке продуктов, который фокусируется на итеративности, сотрудничестве с заказчиком и быстрой адаптации к изменениям.",
    },
    {
      id: 2,
      text: "Назови основные принципы Agile",
      answer: "1.Люди и взаимодействие важнее процессов и инструментов. 2.Работающий продукт важнее исчерпывающей документации. 3.Сотрудничество с заказчиком важнее согласования условий контракта. 4.Готовность к изменениям важнее следования первоначальному плану."
    },
    {
      id: 3,
      text: "Назови методы Agile",
      answer: "Scrum, Kanban, Extreme Programming (XP), Lean, Crystal, Dynamic System Development Method (DSDM)."
    },
    {
      id: 4,
      text: "Какие преимущества есть у Agile?",
      answer: "1.Быстрая адаптация к изменениям. 2.Улучшенное взаимодействие с заказчиком. 3.Раннее выявление проблем. 4.Постоянное улучшение продукта."
    },
    {
      id: 5,
      text: "Расскажи подробнее о Scrum, что это?",
      answer: "Scrum — это фреймворк Agile, который используется для управления проектами и разработки продуктов. Он основан на итерациях (спринтах), ролях (Scrum Master, Product Owner, Developers) и артефактах (бэклог продукта, бэклог спринта, инкремент)."
    },
    {
      id: 6,
      text: "Какие есть этапы в Scrum?",
      answer: "1.Планирование спринта. 2.Ежедневные стендапы (Daily Scrum). 3.Разработка в течение спринта. 4. Обзор спринта (Sprint Review). 5.Ретроспектива спринта (Sprint Retrospective)."
    },
    {
      id: 7,
      text: "Какие преимущества Scrum?",
      answer: "1.Прозрачность процесса разработки. 2.Быстрая обратная связь от заказчика. 3.Гибкость в управлении изменениями. 4.Улучшенное взаимодействие в команде."
    },
    {
      id: 8,
      text: "Что такое Kanban?",
      answer: "Kanban — это метод управления задачами, который визуализирует рабочий процесс на доске с колонками (например, 'Сделать', 'В процессе', 'Готово')."
    },
    {
      id: 9,
      text: "Какие есть принципы Kanban?",
      answer: "1.Визуализация рабочего процесса. 2.Ограничение количества задач в работе (WIP). 3.Управление потоком задач. 4.Постоянное улучшение процесса (Kaizen). Он помогает ограничивать количество задач в работе (WIP) и улучшает поток задач."
    },
    {
      id: 10,
      text: "Подробнее о Kanban доске",
      answer: "Kanban доска — это инструмент визуализации рабочего процесса. Она состоит из колонок (например, 'Сделать', 'В процессе', 'Готово'), в которые перемещаются задачи. (карточки). Это помогает команде видеть статус задач и улучшать процесс."
    },
    {
      id: 11,
      text: "Какие преимущества Kanban?",
      answer: "1.Улучшенная визуализация рабочего процесса. 2.Снижение количества задач в работе (WIP). 3.Улучшенный поток задач. 4.Гибкость и адаптивность."
    },
    {
      id: 12,
      text: "Какие ещё есть методологии помимо Agile?",
      answer: "1.Waterfall (каскадная модель). 2.Spiral (спиральная модель). 3.V-Model (V-образная модель). 4.DevOps. 5.Feature-Driven Development (FDD)."
    },
  ],
};

// 1)
// 2)
// 3)
// 4)
// 5)
// 6)
// 7)
// 8)
// 9)
// 10)
// 11)
// 12)
