export const JSQuestions = {
  id: 602,
  title: "JS questions",
  children: [
    {
      title: "Основные алгоритмы сортировки и поиска",
      children: [
        {
          title: "Алгоритмы сортировки",
          type: "text",
          description: `
                  <p>Вот некоторые из основных алгоритмов сортировки:</p>
                  <li><strong>Пузырьковая сортировка (Bubble Sort)</strong>: Простейший алгоритм сортировки с временной сложностью O(n^2).</li>
                  <li><strong>Сортировка выбором (Selection Sort)</strong>: Делит массив на отсортированную и неотсортированную части, временная сложность O(n^2).</li>
                  <li><strong>Сортировка вставками (Insertion Sort)</strong>: Строит отсортированный массив по одному элементу, временная сложность O(n^2).</li>
                  <li><strong>Сортировка слиянием (Merge Sort)</strong>: Рекурсивный алгоритм с временной сложностью O(n log n).</li>
                  <li><strong>Быстрая сортировка (Quick Sort)</strong>: Делит массив на элементы меньше и больше опорного элемента, временная сложность O(n log n).</li>
                  <li><strong>Сортировка кучей (Heap Sort)</strong>: Использует структуру данных "куча", временная сложность O(n log n).</li>
                `,
        },
        {
          title: "Алгоритмы поиска",
          type: "text",
          description: `
                  <p>Вот некоторые из основных алгоритмов поиска:</p>
                  <li><strong>Линейный поиск (Linear Search)</strong>: Проходит по каждому элементу массива, временная сложность O(n).</li>
                  <li><strong>Бинарный поиск (Binary Search)</strong>: Работает на отсортированных массивах, временная сложность O(log n).</li>
                  <li><strong>Поиск с использованием хеш-таблиц</strong>: Использует хеширование для быстрого поиска, временная сложность O(1) в среднем.</li>
                `,
        },
      ],
    },
    {
      title: "Реализация простого алгоритма на JavaScript",
      children: [
        {
          title: "Факториал числа",
          type: "text",
          description: `
                  <p>Задача: Реализовать функцию, вычисляющую факториал числа.</p>
                  <ul>
                    <li>Факториал числа n (обозначается n!) равен произведению всех положительных целых чисел от 1 до n.</li>
                    <li>Пример: 5! = 5 * 4 * 3 * 2 * 1 = 120</li>
                  </ul>
                `,
          code: `
function factorial(n) {
if (n < 0) return -1; // факториал не существует для отрицательных чисел
if (n === 0) return 1; // 0! = 1
return n * factorial(n - 1); // рекурсивный вызов
}
                `,
        },
      ],
    },
  ],
};
