export const Git = {
  id: 208,
  title: "Что такое Git",
  children: [
    {
      title: "Основное понятие Git",
      type: "text",
      description: `
                  <ul>
                    <li>Git — это распределённая система контроля версий, которая позволяет отслеживать изменения в файлах и работать в команде над проектами.</li>
                    <li>Она была создана Линусом Торвальдсом в 2005 году для разработки ядра Linux.</li>
                  </ul>
                `,
    },
  ],
};
