export const HTMLCSS = {
  id: 2601,
  title: "HTML/CSS",
  children: [
    {
      title: "Основные концепции",
      type: "text",
      description: `
                <ul>
                  <li>Структура HTML документа.</li>
                  <li>Способы подключения стилей в HTML.</li>
                  <li>На что нужно обратить внимание при разработке мультиязычных сайтов?</li>
                  <li>Что такое DOCTYPE и зачем он нужен?</li>
                  <li>Что такое BEM?</li>
                </ul>
              `,
    },
    {
      title: "CSS",
      type: "text",
      description: `
                <ul>
                  <li>Вес селектора или что такое специфичность в CSS.</li>
                  <li>Псевдоклассы и псевдоэлементы.</li>
                  <li>Коробчатая модель (box-sizing).</li>
                  <li>em против rem, относительные и абсолютные значения.</li>
                  <li>Разница между блочными и строчными элементами.</li>
                  <li>Флексбокс.</li>
                  <li>CSS Grid (Сетка).</li>
                  <li>Как использовать CSS-переменные?</li>
                </ul>
              `,
    },
    {
      title: "Семантика",
      type: "text",
      description: `
                <ul>
                  <li>Какие существуют принципы семантической верстки?</li>
                  <li>Что такое #shadow-root в инспекторе HTML-страницы?</li>
                  <li>Как правильно использовать HTML5-теги?</li>
                </ul>
              `,
    },
    {
      title: "Прочее",
      type: "text",
      description: `
                <ul>
                  <li>Что такое прогрессивная развертка?</li>
                  <li>Объясни разницу между script, script async и script defer.</li>
                  <li>Как изменить цвет в SVG файле?</li>
                  <li>Что такое адаптивный и отзывчивый дизайн?</li>
                  <li>Как использовать медиа-запросы в CSS?</li>
                </ul>
              `,
    },
  ],
};
