export const WhatIsDOM = {
  id: 2524,
  title: "Что такое DOM",
  children: [
    {
      title:
        "DOM (Document Object Model) — это программный интерфейс для классов документов HTML и XML. Он представляет структуру документа в виде дерева узлов, где каждый узел соответствует элементу или тексту на странице. DOM позволяет программно изменять структуру, содержимое и стиль документа.",
      type: "text",
      description: `
              <p>С помощью DOM разработчики могут:</p>
                <li>Добавлять, удалять и изменять элементы на странице.</li>
                <li>Изменять атрибуты и стиль элементов.</li>
                <li>Реагировать на события, происходящие в документе.</li>
              <p>DOM позволяет языкам программирования, таким как JavaScript, эффективно взаимодействовать с HTML и динамически изменять пользовательский интерфейс без перезагрузки страницы.</p>
              `,
    },
  ],
};
