export const BinaryNumberSystem = {
  id: 2522,
  title: "Двоичная система счисления",
  children: [
    {
      title:
        "Двоичная система счисления — это система, основанная на двух символах: 0 и 1",
      type: "text",
      description: `
              <p>Она является основой для работы всех цифровых компьютеров, так как они используют двоичную логику для обработки данных. В двоичной системе каждое число представляется как последовательность битов (binary digits), где каждый бит может принимать значение 0 или 1.
              Например, число 5 в десятичной системе представляется как 101 в двоичной системе:</p>
                <li>1  2^2 (4) + 0  2^1 (0) + 1 * 2^0 (1) = 5</li>
              <p>Двоичная система используется для представления данных, выполнения арифметических операций и управления логикой в компьютерах.</p>
              `,
    },
  ],
};
